{
  "post": [
    {
      "id": "0fa5",
      "title": "Casual ",
      "author": "Veronicah",
      "image": "https://images.pexels.com/photos/11511058/pexels-photo-11511058.jpeg",
      "content": "She’s rocking a stylish casual look with a black puffer jacket, blue straight-leg jeans, and white sneakers for a comfy, laid-back vibe. Her gold hoop earrings and black crossbody bag with a chain strap add a touch of chic, while her sleek black hair and confident pose tie the whole outfit together effortlessly.",
      "timestamp": "6/23/2025, 4:34:24 PM"
    },
    {
      "id": "dcd3",
      "title": "Party",
      "author": "Cherry",
      "image": "https://images.pexels.com/photos/13525599/pexels-photo-13525599.jpeg",
      "content": "The party outfit exudes glamour and confidence, featuring a dazzling, deep V-neck sequin dress that hugs the body elegantly. The gold shimmer catches the warm lighting beautifully, creating a radiant and bold look. With its sleeveless cut and backless design, the dress highlights the wearer’s silhouette, while the curly hair and poised expression add to the sophisticated, high-fashion vibe. Perfect for a glamorous night out or red carpet event, this outfit is all about turning heads.",
      "timestamp": "6/23/2025, 4:43:58 PM"
    },
    {
      "id": "08ce",
      "title": "Prom",
      "author": "Lauren ",
      "image": "https://images.pexels.com/photos/24709567/pexels-photo-24709567.jpeg",
      "content": "This prom outfit is a show-stopping combination of elegance and sparkle. The floor-length gown is covered in shimmering silver sequins, featuring a fitted silhouette with daring side cutouts and a high slit that adds both drama and sophistication. The deep neckline and open back enhance its bold, glamorous appeal, while the matching silver platform heels complete the dazzling look. Styled with a chic updo and striking makeup, the outfit radiates confidence and red-carpet-worthy charm, perfect for a memorable night at prom.",
      "timestamp": "6/23/2025, 4:57:13 PM"
    },
    {
      "id": "b627",
      "title": "Date Night",
      "author": "Aurora",
      "image": "https://images.pexels.com/photos/31636417/pexels-photo-31636417.jpeg",
      "content": "A white tight dress paired with cream heels makes for a stunning and sophisticated date-night look. The fitted silhouette of the dress flatters the figure, exuding elegance and confidence with a clean, minimalist charm. The crisp white fabric offers a fresh and polished vibe, while the cream heels add a soft, romantic touch that balances the look perfectly. Whether it's a dinner date or a classy evening out, this outfit is effortlessly chic",
      "timestamp": "6/23/2025, 5:03:13 PM"
    }
  ]
}
